[
    {"role": "doctor", "message": "So, hey Matt, you're my patient. I heard you're having some chest pain. What's going on?"},
    {"role": "patient", "message": "Yeah, I just felt some tightness and shortness of breath and some tightness in my chest and I felt a bit worried."},
    {"role": "doctor", "message": "Okay, when did this all start?"},
    {"role": "patient", "message": "Yesterday."},
    {"role": "doctor", "message": "Okay, tell me a little bit more. Did it start when you were doing something active?"},
    {"role": "patient", "message": "Yeah, I was walking up a big flight of steps. So I kicked off then."},
    {"role": "doctor", "message": "Okay, how long did it take until you felt normal again?"},
    {"role": "patient", "message": "Oh, probably about 20-30 minutes before it kind of all went away, but I started it up again by just getting up and doing some motion around the house just today."},
    {"role": "doctor", "message": "Ah, okay. Did you pass out?"},
    {"role": "patient", "message": "I did not, no, but I felt I had to go sit down."},
    {"role": "doctor", "message": "Any radiation of that pain to your arm or to your jaw?"},
    {"role": "patient", "message": "A little bit in my top left arm, a little bit."},
    {"role": "doctor", "message": "I'm looking at my medical record right now and you have a history of diabetes and hypertension. I think we should take this seriously. Come in this afternoon, let's get an EKG and an echocardiogram and also do some quick blood tests."},
    {"role": "patient", "message": "Okay."},
    {"role": "doctor", "message": "Your diabetes is out of control. I think we're going to have to get a nutritionist involved and start you on a low-salt vegan diabetic diet. Also, I really need you to take metformin 500 milligrams twice a day. And it's time for us to talk about insulin."},
    {"role": "patient", "message": "I hear insulin is very expensive, but is it getting cheaper now?"},
    {"role": "doctor", "message": "We'll find a way to make sure that you can afford the medications you need. Let's get a social worker involved and they'll call you next week."},
    {"role": "patient", "message": "Okay. Thank you, Dr. Rao."},
    {"role": "doctor", "message": "Anything else you want to talk about?"}
]