[
  {
    "role": "doctor",
    "message": "So, hey Matt, you're my patient. I heard you're having some chest pain. What's going on?"
  },
  {
    "role": "patient",
    "message": "Yeah, I just felt, you know, some tightness and shortness of breath and some tightness in my chest and I felt a bit worried."
  },
  { "role": "doctor", "message": "Okay, when did this all start?" },
  { "role": "patient", "message": "Yesterday." },
  {
    "role": "doctor",
    "message": "Okay, tell me a little bit more. Did it start when you were doing something active?"
  },
  {
    "role": "patient",
    "message": "Yeah, I was walking up a big flight of steps. So I kicked off then."
  },
  {
    "role": "doctor",
    "message": "Okay, how long did it take until you felt normal again?"
  },
  {
    "role": "patient",
    "message": "Oh, probably about 20-30 minutes before it kind of all went away, but I started it up again by just getting up and doing some motion around the house just today."
  },
  {
    "role": "doctor",
    "message": "Okay, did you notice any pounding in your chest or palpitations?"
  },
  {
    "role": "patient",
    "message": "A little bit, yes. A little bit of lightheadedness as well."
  },
  { "role": "doctor", "message": "Ah, okay. Did you pass out?" },
  {
    "role": "patient",
    "message": "I did not, no, but I felt I had to go sit down."
  },
  {
    "role": "doctor",
    "message": "I see. Any radiation of that pain to your arm or to your jaw?"
  },
  {
    "role": "patient",
    "message": "A little bit in my, a little bit in the top left arm, a little bit."
  },
  {
    "role": "doctor",
    "message": "Okay, all right. So, you know, I'm looking at my medical record right now and you have a history of diabetes and hypertension. And I bring that up because, you know, this is chest pain and obviously I'm a cardiologist, the first thing I think about is could this be a heart attack? Could this be what we call unstable angina, which means that you could have blockages in your heart that we need to address immediately. So, you have these risk factors for heart disease like diabetes, hypertension. Your great-great-great-grandfather had a history of heart disease too. So, I think we should take this seriously. Come in this afternoon, let's get an EKG and an echocardiogram and also do some quick blood tests, like get a CBC and a basic metabolic panel and a troponin level. Those are studies that'll give us a sense of how much stress your body's under. Okay?"
  },
  { "role": "patient", "message": "Okay." },
  {
    "role": "doctor",
    "message": "Okay. All right. And then I'm a full-service cardiologist, so I want to talk about your other problems really quick as well. Your diabetes is out of control. Your last hemoglobin A1C was through the roof. It was like a billion in January. So, I'm curious, are you taking your metformin every day?"
  },
  {
    "role": "patient",
    "message": "Well, sometimes I take it when I remember, but it works really well on the chocolate cake, right? So, if I take it with the chocolate cake, it's fine. Yeah?"
  },
  {
    "role": "doctor",
    "message": "Oh, I don't know about that. I think we're going to have to get a nutritionist involved because it's not just the cake. I saw you at McDonald's last week. You had like 20 Big Macs in front of you and a whole bunch of French fries. So, I'm going to ask our nutritionist to call you next week, start you on a low-salt vegan diabetic diet. It's going to be delicious. But also, I really need you to take metformin 500 milligrams twice a day. This is so important. And finally, it's time for us to talk about insulin. So, our nurse is going to call you on Friday. You've been reluctant in the past, but I think it's time for us to just talk about insulin. I hear insulin is very expensive, but is it getting cheaper now? We'll find a way to make sure that you can afford the medications you need. So, why don't we also get a social worker involved and they'll call you next week and we can make sure that you've got a supply of everything. Okay?"
  },
  { "role": "patient", "message": "Okay. All right. Thank you, Dr. Rao." },
  {
    "role": "doctor",
    "message": "Okay. Anything else you want to talk about?"
  },
  {
    "role": "patient",
    "message": "I think that sounds like a lot for just one and a half hours. All right. Awesome."
  }
]
